# GetMultiSegementGridId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultiSegmentGrid..::..GetMultiSegementGridId Method
MultiSegmentGrid Class See Also
---
Retrieve the element id of the MultiSegmentGrid of which the specified Grid is a member.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static ElementId GetMultiSegementGridId(
	Grid grid
)
```

Visual Basic
---
```text
Public Shared Function GetMultiSegementGridId ( _
	grid As Grid _
) As ElementId
```

Visual C++
---
```text
public:
static ElementId^ GetMultiSegementGridId(
	Grid^ grid
)
```

# ### Parameters
grid
    Type: Autodesk.Revit.DB..::..Grid A Grid.
# ### Return Value
The element id of the associated GridChain. If the Grid is not associated to a GridChain, this will return invalidElementId.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
MultiSegmentGrid Class
Autodesk.Revit.DB Namespace